In [1]:
import pandas as pd

### Create this dataframe
            city  population  rainfall
0       San Jose          10      15.5
1  San Francisco           5      10.2
2    Los Angeles          30       5.5
3        Seattle           7      50.5

In [2]:
population_dict = {'San Jose': 10,
                   'San Francisco': 5,
                   'Los Angeles': 30,
                   'Seattle': 7}
population = pd.Series(population_dict)
population

San Jose         10
San Francisco     5
Los Angeles      30
Seattle           7
dtype: int64

In [3]:
rainfall_dic = {'San Jose': 15.5,
                'San Francisco': 10.2,
                'Los Angeles': 5.5,
                'Seattle': 50.5}
rainfall = pd.Series(rainfall_dic)
rainfall

San Jose         15.5
San Francisco    10.2
Los Angeles       5.5
Seattle          50.5
dtype: float64

In [13]:
data = pd.DataFrame({'population':population, 'rainfall':rainfall})
data

               population  rainfall
San Jose               10      15.5
San Francisco           5      10.2
Los Angeles            30       5.5
Seattle                 7      50.5

### C1 - Set population for San Francisco to 12

In [14]:
data.iloc[1:2, 0:1] = 12

In [15]:
data

               population  rainfall
San Jose               10      15.5
San Francisco          12      10.2
Los Angeles            30       5.5
Seattle                 7      50.5

### C2 - Add a new row as follows 
city: 'San Diego', population: 8, rainfail: 7.5

In [18]:
new_population = pd.Series({'San Diego':8})
new_rainfall = pd.Series({'San Diego':7.5})
data2 = pd.DataFrame({'population':new_population, 'rainfall':new_rainfall})

In [19]:
data2

           population  rainfall
San Diego           8       7.5

In [20]:
data = data.append(data2)

In [21]:
data

               population  rainfall
San Jose               10      15.5
San Francisco          12      10.2
Los Angeles            30       5.5
Seattle                 7      50.5
San Diego               8       7.5

# D - Searching

### D1 - Print rows where population > 10

In [23]:
data.loc[data.population > 10]

               population  rainfall
San Francisco          12      10.2
Los Angeles            30       5.5

### D2 - Print rows where population > 10 and rainfal < 10

In [30]:
data.loc[data.rainfall <10.0].loc[data.population > 10]

             population  rainfall
Los Angeles          30       5.5

# E - Reading Files

### E1 - Read the csv files

In [34]:
house_sales = pd.read_csv('house-sales-sample.csv')

In [35]:
house_sales.head(10)

,ID,Date,SalePrice,PropertyID,PropertyType,Bedrooms,Bathrooms,SqFtTotLiving,SqFtLot,YrBuilt,ZipCode
0,26353,11/27/12,716831,9526550170,Single Family,5,3.50,3470,5326,2012,-1
1,22594,1/30/07,439900,8078100090,Single Family,4,2.50,2250,9988,1992,98031
2,10916,3/9/10,415000,3330501975,Single Family,5,2.00,2040,6180,1908,98118
3,11555,6/25/08,1050000,3459900305,Single Family,4,3.25,3520,19354,1978,98006
4,19360,9/24/08,777990,7203101030,Single Family,4,2.50,3610,5958,2008,98053
5,15582,7/25/06,465000,5113400050,Single Family,2,1.75,2020,4945,1927,98119
6,3152,10/13/06,450000,1222069094,Single Family,3,1.75,1350,155073,1969,98038
7,4759,3/20/07,220000,1656500585,Single Family,3,1.00,1300,13200,1935,98059
8,26660,6/5/08,500000,9551202210,Single Family,2,1.00,1380,2963,1923,98103
9,18533,5/12/06,420000,6806100510,Single Family,4,2.50,3150,4751,2005,98058